# GetVCurveTangentAtStation Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Alignment..::..GetVCurveTangentAtStation Method
Alignment Class See Also
---
Calculate 2d (X and Y components of returned vector) vertical tangent at given station.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public XYZ GetVCurveTangentAtStation(
	double station
)
```

Visual Basic
---
```text
Public Function GetVCurveTangentAtStation ( _
	station As Double _
) As XYZ
```

Visual C++
---
```text
public:
XYZ^ GetVCurveTangentAtStation(
	double station
)
```

# ### Parameters
station
    Type: System..::..DoubleAlignment station to calculate 2d vertical tangent for, in Revit internal model units (standard Imperial feet).
# ### Return Value
2d (X and Y components of returned vector) vertical tangent at given station.
# See Also
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace